{"pages":[{"title":"Publication","text":"2023 Huijun Liu, Bin Ji, Jie Yu, Shasha Li, Jun Ma, Zibo Yi, Mengxue Du, Miaomiao Li, Jie Liu, Zeyao Mo. A More Context-aware Approach for Textual Adversarial Attacks using Probability Difference-guided Beam Search. (IEEE Transactions on Knowledge and Data Engineering, TKDE) (CCF-A类国际期刊) Mengxue Du, Shasha Li, Jie Yu, Jun Ma, Huijun Liu, Miaomiao Li, Bin Ji. DADR: A Denoising Approach for Dense Retrieval ModelTraining. The 7th APWeb-WAIM In-ternational Joint Conference on Web and Big Data. (APWeb-WAIM2023).(CCF-C类国际会议) Xi Deng,Shasha Li, Jie Yu, Jun Ma. HM-Transformer: Hierarchical Multi-modalTransformer for Long Document Image Understanding.The 7th APWeb-WAIM In-ternational Joint Conference on Web and Big Data.(APWeb-WAIM2023).(CCF-C类国际会议) Miaomiao Li, Jie Yu, Jun Ma, Shasha Li, Huijun Liu, Mengxue Du. QAE: A Hard-label Textual Attack Considering the Comprehensive Quality of Adversarial Examples. The 12th CCF International Conference on Natural Language Processing and Chinese Computing (NLPCC2023)(CCF-C类国际会议) Yingwei Ma, Yue Yu, Shanshan Li, Zhouyang Jia, Jun Ma, Rulin Xu, Wei Dong, Xiangke Liao. MulCS: Towards a Unified Deep Representation for Multilingual Code Search. The 30th IEEE International Conference on Software Analysis, Evolution and Reengineering (SANER 2023), Macao, China. (CCF-B类国际期刊) Jing Yang, Bin Ji, Shasha Li, Jun Ma, Long Peng, Jie Yu. Dynamic Multi-View Fusion Mechanism For Chinese Relation Extraction. Pacific-Asia Conference on Knowledge Discovery and Data Mining (PAKDD2023) (CCF-C类国际会议) 2022 Bin Ji, Shasha Li, Jie Yu, Jun Ma, Huijun Liu, Jing Yang. Win-Win Cooperation: Bundling Sequence and Span Models for Named Entity Recognition. Submitted to IEEE Transactions on Knowledge and Data Engineering (CCF-A类国际期刊) Jing Yang, Bin Ji, Shasha Li, Jun Ma, Jie Yu. SciCN: A Scientific Dataset for Chinese Named Entity Recognition. Submitted to CMC-Computers, Materials &amp; Continua (中科院3区, IF=3.89) Bin Ji, Shasha Li, Shaoduo Gan, Jie Yu, Jun Ma, Huijun Liu, Jing Yang. Few-shot Named Entity Recognition with Entity-level Prototypical Network Enhanced by Dispersedly Distributed Prototypes, COLING, 2022. (CCF-B类国际会议) Bin Ji, Shasha Li, Jie Yu, Jun Ma, Huijun Liu, Jing Yang. Span-based Joint Entity and Relation Extraction Augmented with Sequence Tagging Mechanism, Science-China Information Sciences, 2022. (CCF-B类国际期刊) Huijun Liu, Jie Yu, Jun Ma, Shasha Li, Bin Ji, Zibo Yi, Miaomiao Li, Long Peng, and Xiaodong Liu. Textual Adversarial Attacks by Exchanging Text-Self Words, International Journal of Intelligent Systems, 2022. (CCF-C类国际期刊, 中科院1区Top, IF=8.75) Hao Xu, Long Peng, Xiaodong Liu, Menglin Zhang, Jun Ma, Jie Yu, Zibo Yi. KylinTune: DQN-based Energy-efficient Model for Browser in Mobile Devices. 41st IEEE International Performance Computing and Communications Conference, IPCCC, 2022. (CCF-C类国际会议) Miaomiao Li, Jie Yu, Shasha Li, Jun Ma, Huijun Liu. Textual Adversarial Attacks on Named Entity Recognition in a Hard Label Black Box Setting, 15th International Conference on Advanced Computer Theory and Engineering, 2022. (EI) Bin Ji, Yalong Xie, Jie Yu, Shasha Li, Jun Ma, Yun Ji, Huijun Liu. A novel bundling learning paradigm for named entity recognition. knowledge-based systems,2022. (CCF-C类国际期刊,中科院1区top, IF=6.35) Mengxue Du, Shasha Li, Jie Yu, Jun Ma, Bin Ji, Huijun Liu, Wuhang Lin, Zibo Yi. Topic-Grained Text Representation-based Model for Document Retrieval. ICANN,2022. (CCF-C类国际会议) Wuhang Lin, Shasha Li, Chen Zhang, Bin Ji, Jie Yu, Jun Ma, Zibo Yi. SummScore: A Comprehensive Evaluation Metric for Summary Quality Based on Cross-Encoder. APWeb-WAIM,2022. (CCF-C类国际会议) Bin Ji, Hao Xu, Jie Yu, Shasha Li, Jun Ma, Huijun Liu, A Two-Phase Paradigm for Joint Entity-Relation Extraction. CMC-computers, materials and continua. 2022. (SCI, 中科院3区) Jie Yu, Bin Ji, Shasha Li, Jun Ma, Huijun Liu, Hao Xu. S-NER: A Concise and Efficient Span-based Model for Named Entity Recognition. Sensors, 2022. (SCI, 中科院3区) 2021 马俊，周凯，任怡，朱浩，秦莹，王静 面向操作系统版本构建的软件包依赖关系分析[J]. 计算机工程与科学,2021,43(11):1926-1933 (CCF-B类中文核心期刊) Zibo Yi, Jie Yu, Yusong Tan, and Qingbo Wu. 2021. Fine-tuning more stable neural text classifiers for defending word level adversarial attacks. Applied Intelligence, 2021. (CCF-C类国际期刊) Xiaohu Du, Jie Yu, Shasha Li, Zibo Yi and Jun Ma. Combating Word-level Adversarial Text with Robust Adversarial Training. 2021 International Joint Conference on Neural Networks (IJCNN). 7(18-22), 2021. (CCF-C类国际会议) Wuhang Lin, Jianling Li, Zibo Yi, Bin Ji, Shasha Li, Jie Yu, Jun Ma. A Unifified Summarization Model with Semantic Guide and Keyword Coverage Mechanism. International Conference on Artificial Neural Networks (ICANN), 2021. (CCF-C类国际会议) Zibo Yi, Jie Yu, Yusong Tan, Qingbo Wu. A Multimodal Adversarial Attack Framework Based on Local and Random Search Algorithms. International Journal of Computational Intelligence Systems, 7(5), 2021. (SCI期刊, 中科院4区) 余杰,纪斌,李莎莎,马俊, 刘慧君.面向中文医疗事件的联合抽取方法.计算机科学,2021. (CCF-B类中文核心期刊) Hao Xu, Long Peng, Tao Mao, Jun Ma, Shasha Li, Jie Yu, Qingbo Wu. B2GPAPI: an Efficient Framework Providing C/C++ Runtime in Web-based OS. 2021 the 11th International Workshop on Computer Science and Engineering (WCSE 2021). Shanghai, China, June 19-21, 2021. Hao Xu, Long Peng, Tao Mao, Wenjie Li, Jun Ma, Shasha Li, Jie Yu, Qingbo Wu. A Framework to Run C/C++ Application on Web-based OS. 14th International Conference on Advanced Computer Theory and Engineering (ICACTE 2021). Hangzhou, China, September 17-19, 2021. Hao Xu, Long Peng, Jun Ma, Shasha Li, Jie Yu, Qingbo Wu. A Power-on Hardware Self-test Framework in Web-based OS. The 20th Distributed Computing and Applications in Business, Engineering, and Sciences Conference (DCABES 2021). Guangxi, China, December 10~12, 2021. Jianling Li, Wuhang Lin, Shasha Li, Jie Yu, Jun Ma. Hierarchical Encoder-Decoder Summary Model With An Instructor For Long Academic Papers. 2021 IEEE the 6th International Conference on Computer and Communication Systems. Peng Long, Xu Hao, Yu Jie, Liu Xiaodong, Guan Fei. EmSBoTScript: A Tiny Virtual Machine-Based Embedded Software Framework. 284-289, 2021. Guan, Fei &amp; Peng, Long &amp; Qiao, Jiaqing. (2021). A Fluid Scheduling Algorithm for DAG Tasks with Constrained or Arbitrary Deadlines. IEEE Transactions on Computers. PP. 1-1. 10.1109/TC.2021.3111512. 2020 Bin Ji, Jie Yu, Shasha Li, Jun Ma, Qingbo Wu, Yusong Tan. Span-based Joint Entity and Relation Extraction with Attention-based Span-specific and Contextual Semantic Representations. The 28th International Conference on Computational Linguistics (COLING2020), 2020. (CCF-B类国际会议) Bin Ji, Shasha Li, Jie Yu, Jun Ma, Yusong Tan, Qingbo Wu, - Huijun Liu, Yun Ji. Research on Chinese medical named entity recognition based on collaborative cooperation of multiple neural network models . Journal of Biomedical Informatics, 104, 2020. (CCF-C类国际期刊) Xiaohu Du, Jie Yu , Zibo Yi, Shasha Li, Jun Ma, Yusong Tan, and Qinbo Wu. A Hybrid Adversarial Attack for Different Application Scenarios. Applied Sciences-Basel. 2020; 10(10):3559. (SCI期刊, 中科院3区) 杜小虎, 吴宏明, 易子博, 李莎莎, 马俊, 余杰. 文本对抗攻击与防御技术综述.中文信息学报,2020. (CCF-B类中文核心期刊) 余杰,纪斌,吴宏明,任意,李莎莎,马俊. 一种基于span的实体和关系联合抽取方法. 计算机工程与科学, 2020. (CCF-C类中文核心期刊) 李莎莎,梁冬阳,余杰,纪斌,吴庆波,谭郁松. 基于师门关系的研究团队挖掘算法,计算机应用,40(11),2020. (CCF-C类中文核心期刊) Yongtao Tang, Jie Yu, Shasha Li, Bin Ji, Yusong Tan, Qingbo Wu. Span Classification Based Model for Clinical Concept Extraction. The 2020 16th International Conference on Natural Computation, Fuzzy Systems and Knowledge Discovery, 2020. Yijia Liu, Bin Ji, Jie Yu, Yusong Tan, Jun Ma, Qingbo Wu. An Advanced ICD-9 Terminology Standardization Method Based on BERT and Text Similarity. The 2020 16th International Conference on Natural Computation, Fuzzy Systems and Knowledge Discovery, 2020. Xiaohu Du, Zibo Yi, Shasha Li, Jun Ma, Jie Yu, Yusong Tan, and Qinbo Wu. Generating More Effective and Imperceptible Adversarial Text Examples for Sentiment Classification//International Conference on Artificial Intelligence and Security. Springer, Cham, 2020: 422-433. 2019 Yi Zibo, Jie Yu, Shasha Li, Yusong Tan, and Qingbo Wu. Incremental Learning of GAN for Detecting Multiple Adversarial Attacks. In International Conference on Artificial Neural Networks (ICANN), pp. 673-684. Springer, Cham, 2019. (CCF-C类国际会议) Jianling Li, Shiwen Yu, Shasha Li, Jie Yu. Multi-classification of Theses to Disciplines Based on Metadata. Natural Language Processing and Chinese Computing (NLPCC). Lecture Notes in Computer Science, vol 11839. Springer, Cham, 2019. (CCF-C类国际会议) Bin Ji, Rui Liu, Shasha Li, Jie Yu, Qingbo Wu, Yusong Tan and Jiaju Wu. A hybrid approach for named entity recognition in Chinese electronic medical record, BMC Medical Informatics and Decision Making, 19, Article number: 64, 2019. (SCI, 中科院3区) Dongyang Liang, Shasha Li, Jie Yu, Bin Ji. Design and Implementation of an XML Schema Based XML Data Editor. The 9th International Workshop on Computer Science and Engineering, 2019. Dongyang Liang, Shasha Li, Jie Yu, Bin Ji. Using KG to Choose the Research Supervisor for Postgraduate. The 8th International Conference on Computer Technology and Science, 2019. 2018 张运中, 纪斌, 刘磊, 余杰. 基于多神经网络协作的电子病历命名实体识别方法.计算机应用与软件, 2020. (CCF-C类中文核心期刊) 蒋林轩, 余杰, 刘晓东, 吴东波, 孔金珠. 一种事件驱动的生物特征识别框架服务的设计与实现. 信息技术与网络安全. 37(12):18-25, 2018. 蒙立荣, 马永起, 程铮, 余杰, 吴家菊, 刘振吉. 基于过程数据模块的装备故障诊断技术研究. 信息技术与网络安全. 37(12):66-70, 2018. 马永起, 韩德培, 蒙立荣, 余杰, 程铮. 基于How-net的词语语义相似度算法. 计算机工程. 44(6):151-155, 2018. Peng, Long &amp; Guan, Fei &amp; Perneel, Luc &amp; Fayyad, Hasan &amp; Timmerman, Martin. (2018). Decentralized Multi-Robot Formation Control with Communication Delay and Asynchronous Clock. Journal of Intelligent &amp; Robotic Systems. 89. 10.1007/s10846-017-0557-y. Bin Ji, Rui Liu, Shasha Li, Jintao Tang, Jie Yu, Qian Li, Weisang Xu. A BiLSTM-CRF Method to Chinese Electronic Medical Record Named Entity Recognition. Proceedings of the 2018 International Conference on Algorithms, Computing and Artificial Intelligence (ACAI), 2018. Zibo Yi, Shasha Li, Jie Yu, Yusong Tan, Qingbo Wu. A Novel Misclassification Attack Against Black Box Neural Network Classifiers. Proc. of The 14th International Conference on Semantics, Knowledge and Grids. IEEE, 2018. 余杰, 马俊, 彭欢, 魏立峰, 孔金珠. 轻量级插件式Linux图形桌面环境设计与优化技术. 信息技术与网络安全, V37, p9-12, (9), 2018. Dongyang Liang, Shasha Li, Bin Ji, Zibo Yi, Jie Yu, Jianfeng Zhang, Yusong Tan, Qingbo Wu. Research on Matrix Multiplication Based WeChat Group Tagging Technology. AIKE, 2018. Zhaoyun Chen, Lei Luo, Wei Quan, Yang Shi , Jie Yu, Mei Wen and Chunyuan Zhang. Multiple CNN-based Tasks Scheduling across Shared GPU Platform in Research and Development Scenarios. HPCC 2018. 2017 Chengsen Ru, Jintao Tang, Shasha Li, and Ting Wang. 2017. Syntactic Representation Learning for Open Information Extraction on Web. (WWW ‘17 ) Guan, Fei &amp; Peng, Long &amp; Perneel, Luc &amp; Fayyad, Hasan &amp; Timmerman, Martin. (2017). A Design That Incorporates Adaptive Reservation into Mixed-Criticality Systems. Scientific Programming. 2017. 1-20. 10.1155/2017/3403685. 马永起, 蒙立荣, 余杰, 吴家菊, 程铮. 面向IETM的PDF文档发布模型研究. 微型机与应用, 36(24):87-91, 2017. 马永起, 蒙立荣, 余杰, 吴家菊, 程铮. 基于IETM浏览平台的数据访问控制模型. 微型机与应用, 36(20):87-91, 2017. Jack Yu, Ubuntu Kylin, a Linux Distribution with a Microsoft Windows Experience, Linux Journal, https://www.linuxjournal.com /content/ubuntu-kylin -linux-distribution-microsoft-windows-experience, 2017. Zibo Yi , Shasha Li , Jie Yu, Yusong Tan, Qingbo Wu, Hong Yuan, and Ting Wang. Drug-drug Interaction Extraction via Recurrent Neural Network with Multiple Attention Layers. Advanced Data Ming and Applications (ADMA), 5-6 November 2017. Jie Lin, Yusong Tan, Qingbo Wu, Xiaoling Li, Jie Yu, Qi Zhang. An Optimization and Auto-tuning Method for Scale-free Graph Algorithms on SIMD Architectures, The 15th IEEE International Symposium on Parallel and Distributed Processing with Applications (IEEE ISPA 2017), Guangzhou, China, December 12-15, 2017. Jie Lin, Qingbo Wu, Yusong Tan, Jie Yu, et. al. MicRun: A framework for Scale-free Graph Algorithms on SIMD Architecture of the Xeon Phi,The 28th Annual IEEE International Conference on Application-specific Systems, Architectures and Processors (ASAP), July 10th-12th 2017. Lu Si, Jie Yu, Shasha Li, Jun Ma, et. al. FCNN-MR: A Parallel Instance Selection Method Based on Fast Condensed Nearest Neighbor Rule. International Journal of Computer, Electrical, Automation, Control and Information Engineering Vol:11, No:7, 2017. Qintao Shen, Lei Luo, Jun Ma, Jie Yu, et al. An Improved Method on Static Binary Analysis to Enhance the Context-Sensitive CFI. 2017. 2016 Jie Yu, Lu Si, Jun Ma, Lei Luo, et al. UKUI: A Lightweight Desktop Environment Based on Pluggable Framework for Linux Distribution, 2016 International Conference on Artificial Intelligence and Computer Science, Guilin, China. December 23-25, 2016. Lu Si, Jie Yu, Wuyang Wu, Jun Ma, Qingbo Wu, Shasha Li. RMHC-MR: Instance Selection by Random Mutation Hill Climbing Algorithm with MapReduce in Big Data. 8th International Conference on Advances in Information Technology, IAIT2016, 19-22, December 2016. Jie Yu, Shasha Li, Shaoduo Gan, Qi Zhang, et al. Understanding Long-Term Trends of DHT Networks. 5th International Conference on Computer Science and Network Technology (ICCSNT 2016), Changchun, China, December 10-11, 2016. Qi Zhang, Shasha Li, Qingbo Wu, Jie Yu. Improving DHT Load Balance Using the Churn, 16th IEEE International Conference on Computer and Information Technology (CIT), Shangri-La’s Fijian Resort and Spa, Fiji, 7-10 December 2016. 沈钦涛, 张丽, 罗磊, 马俊, 余杰, 吴庆波, 李莎莎. 上下文敏感的控制流完整性保护的改进方法, 第15届全国软件与应用学术会议(NASAC), 2016. 沈钦涛, 张丽, 罗磊, 马俊, 余杰, 吴庆波, 李莎莎. 上下文敏感的控制流完整性保护的改进方法, 计算机科学, 11:87-90, 2016. Lu Si, Jie Yu, Lei Luo, Jun Ma, Qingbo Wu, and Shasha Li. ROP-Hunt: Detecting Return-oriented Programming Attacks in Applications, SpaCCS, 2016 (Best Paper). Zibo Yi, Jun Ma, Lei Luo, Jie Yu, Qingbo Wu. Improving JavaScript Malware Classifier’s Security against Evasion by Particle Swarm Optimization. UbiSafe, 2016. Zibo Yi, Jun Ma, Lei Luo, Jie Yu and Qingbo Wu. Multiple Classifier Systems for More Accurate JavaScript Malware Detection. ICPIT, 2016. Shaoduo Gan, Jiexin Zhang, Jie Yu, Xiaoling Li, Jun Ma, Lei Luo, Qingbo Wu. A Novel Optimization Scheme for Caching in Locality-aware P2P Networks, ISCC, 2016. Shaoduo Gan, Jie Yu, Xiaoling Li, Jun Ma, Lei Luo, Qingbo Wu, Shasha Li. ERPC: An Edge-Resources Based Framework to Reduce Bandwidth Cost in the Personal Cloud, The 17th International Conference on Web-Age Information Management. June 3-5, 2016. Qi Zhang, Jie Yu, Lei Luo, Jun Ma, Qingbo Wu, Shasha Li. An Optimized DHT for Linux Package Distribution, 15th International Symposium on Parallel and Distributed Computing(ISPDC2016). July 8-10, 2016. Past 马俊; 王志英; 任江春; 伍江江; 程勇; 梅松竹 一种实现数据主动泄漏防护的扩展中国墙模型[J]. 软件学报, 2012, (03): 677-687. (CCF-A类中文核心期刊) 马俊; 王志英; 任江春; 刘聪; 伍江江; 程勇; 梅松竹 TRSF:一种移动存储设备主动防护框架[J]. 电子学报, 2012, (02): 376-383. (CCF-A类中文核心期刊) Cheng, Yong; Ma, Jun; Ren, Jiangchun; Mei, Songzhu; Wang, Zhiying UTrustDisk: An Efficient Data Protection Scheme for Building Trusted USB Flash Disk[J]. KSII Transactions on Internet and Information Systems, 2017, 11(4): 2276-2291. Jie Yu, Liming Lu, and Zhoujun Li. KadCache: Employing Kad to Mitigate Flash Crowds and Application Layer DDoS Attacks against Web Servers. The 35th ACM International Conference of The Special Interest Group on Data Communication (SIGCOMM’09) Poster Session, Barcelona, Spain, August, 17-21, 2009. (CCF-A类国际会议) Shasha Li, Chin-Yew Lin, Young-In Song, Zhoujun Li:Comparable Entity Mining from Comparative Questions. ACL, 2010. (CCF-A类国际会议) Shasha Li, Chin-Yew Lin, Young-In Song, Zhoujun Li:Comparable Entity Mining from Comparative Questions. IEEE Trans. Knowl. Data Eng. 25(7): 1498-1509, 2013. (CCF-A类国际期刊) Jie Yu, Liming Lu, Zhoujun Li, Xiaofeng Wang, Jinshu Su. A Simple Effective Scheme to Enhance the Capability of Web Servers Using P2P Networks. The 39th International Conference on Parallel Processing (ICPP’10), San Diego, USA, September 13-16, 2010. (CCF-B类国际会议) Jie Yu, Zhoujun Li, Peng Xiao, Chengfang Fang, Jia Xu, Ee-Chien Chang. ID Repetition in Structured P2P Networks. The Computer Journal. Volume 54, Issue 6, 2011. (CCF-B类国际期刊) Jie Yu, Liming Lu, and Zhoujun Li. Characterizing Lookup Traffic in Kad. The 17th IEEE International Conference on Network Protocols (ICNP’09) Poster Session, Princeton, USA, October, 13-16, 2009. (CCF-B类国际会议) Jie Yu, Liming Lu, Zhoujun Li. Monitoring, Analyzing and Characterizing Lookup Traffic in a Large-scale DHT. Computer Communications, Volume 34, Issue 13, 2011. (CCF-C类国际期刊) Jie Yu, Chengfang Fang, Jia Xu, Ee-Chien Chang, and Zhoujun Li. ID Repetition in Kad. The 9th IEEE International Conference on Peer-to-Peer Computing (P2P’09), p111-120, Seattle, USA, September, 9-11, 2009. (CCF-C类国际会议) Jie Yu, Zhoujun Li, and Xiaoming Chen. Misusing Kad protocol to perform DDoS attacks. The 6th IEEE International Symposium on Parallel and Distributed Processing and Applications (ISPA’08), Sydney, Australia, December, 10-12, 2008. (CCF-C类国际会议) Jie Yu, Chengfang Fang, Liming Lu, and Zhoujun Li. Mitigating Application Layer DDoS Attacks Via Lightweight and Effective Trust Management. IET Communications, Volume 4, Issue 16, p.1952-1962, 2010. 2010. (CCF-C类国际期刊) Jie Yu, Peng Xiao, Zhoujun Li, Yuan Zhou. Towards an Accurate Snapshot of DHT Networks. IEEE Communication Letters, Volume 15, Issue 1, p.97-99, 2011. (SCI, 中科院3区) Jie Yu, Chengfang Fang, Liming Lu, and Zhoujun Li. A Lightweight Mechanism to Mitigate Application Layer DDoS Attacks. The 4th International ICST Conference on Scalable Information Systems (INFOSCALE’09), Hong Kong, China, June, 10-11, 2009.","link":"/publication/index.html"},{"title":"Team","text":"Current StudentsPHD Huijun Liu｜Artificial Intelligence Security｜liuhuijun[at]nudt.edu.cn Yongtao Tang｜Information Extraction｜tangyongtao18[at]nudt.edu.cn Shezheng Song｜Text Summarization｜ssz614[at]nudt.edu.cn Xiaopeng Li | Refreshing LLM| xiaopengli[at]nudt.edu.cn Xi Wang | LLM Security | wx2023[at]nudt.edu.cn Master Miaomiao Li｜Artificial Intelligence Security｜limiaomiao21[at]nudt.edu.cn Chuang Zhang | Operating System and Knowledge Graph | - Binrui Zeng | Artificial Intelligence for Operating System | zengbinrui[at]nudt.edu.cn Zhilong Liu | Artificial Intelligence for Operating System | liuzhilong23[at]nudt.edu.cn Xinran Hong | Artificial Intelligence for Operating System | hongxinran[at]nudt.edu.cn Zhuoyi Huang | Artificial Intelligence for Operating System | 1586699654[at]qq.com Graduated StudentsPHD 2022 (2018.09 - 2022.06) Bin Ji |Postdoc in National University of Singapore｜Information Extraction｜jibin[at]nudt.edu.cn 2021（2017.09-2021.12） Zibo Yi｜Department in Beijing，Work｜Artificial Intelligence Security｜yizibo14[at]nudt.edu.cn Shaoduo Gan｜Department in Beijing，Work｜Distributed Machine Learning｜ganshaoduo[at]nudt.edu.cn Master 2023 (2020.09-2023.03) Jing Yang｜HuaWei (Changsha｜ Information Extraction｜yangjing2036[at]126.com Mengxue Du｜HuaWei (Wuhan) ｜ Information Retrieval｜dumengxuenudt[at]nudt.edu.cn Xi Deng｜BYD (Xi’An)｜Text Assessment｜deng[at]nudt.edu.cn 2022 (2019.09-2022.06) Wuhang Lin｜NetEase(网易) SSP offer｜Text Summarization｜wuhanglin[at]nudt.edu.cn 2021（2019.09-2021.12） Hao xu｜Department in Guangdong，Work｜ Web Operating System｜ xuhao19[at]nudt.edu.cn 2020（2018.09-2021.06） Xiaohu Du｜Huazhong University of Science and Technology，PH.D.｜Artificial Intelligence Security | xhdu18[at]foxmail.com Jianling Li｜Tianjin University，PH.D.| Text Summarization | jianlingl[at]nudt.edu.cn Yongtao Tang｜National University of Defense Technology，PH.D.| Information Extraction｜tangyongtao18[at]nudt.edu.cn Yijia Liu｜Head office of Changsha Bank，Work| Information Extraction｜ 2019（2017.06-2019.12） Dongyang Liang｜Department in Zhejiang，Work｜Science and Technology Literature Mining｜liangdongyang10[at]yeah.net 2018（2015.9-2018.6） Lu Si｜Tsinghua University，PH.D.｜Big Data and Knowledge Graph｜lusi[at]ubuntukylin.com Jie Lin｜Department in Sichuan，Work｜Big Data and Knowledge Graph｜mr_lin0215[at]163.com 2017（2014.9-2017.6） Shaoduo Gan｜Eidgenössische Technische Hochschule Zürich，PH.D.｜Distributed Machine Learning｜ganshaoduo[at]nudt.edu.cn Zibo Yi｜National University of Defense Technology，PH.D.｜Artificial Intelligence Security｜yizibo14[at]nudt.edu.cn Qi Zhang｜Department in Guangdong，Work｜Distributed Operating System｜ Qintao Shen｜Institute of Information Engineering，Chinese Academy of Sciences，PH.D.｜System Security｜","link":"/team/index.html"},{"title":"Datasets","text":"Information Extractiontbd Text Summarizationtbd Nerual Robusttbd Dataset Task #Classes Train Test Avg Len Link AG’s News Classification 4(World, Sport, Business, Science/Technology) 30k 1.9k 43 download QNLI Classification 2(yes, no) 105k 5.4k 11/31 download Fake News Classification 2(fake, not fake) 18.8k 2k 885 download MR Classification 2(positive, negative) 9k 1k 20 download IMDB Classification 2(positive, negative) 25k 25k 215 download Yelp Classification 2(positive, negative) 560k 38k 152 download SST-2 Classification 2(positive, negative) 6920 1821 17 download SNLI Entailment 3(entailment, contradiction, neutral) 570k 3k 8 download MNLI Entailment 3(entailement, contradiction, neutral) 433k 10k 23/11 download","link":"/datasets/index.html"},{"title":"Photos","text":"银河后楼小伙伴们的(学习)娱乐日常！ 2023～中文信息学会～（北京游玩）~ CCF中国软件大会 ~（上海游玩） 2022火锅！火锅！ “工位一赏” 2021“百果园”欢送毕业生 ADL讲习班（北京游玩） 留校过年的团建 2020CCKS20会议（南昌游玩） 火锅！火锅！","link":"/photos/index.html"},{"title":"Teachers","text":"Jie Yu Jie Yu obtained BS and PHD from National University of Defense Technology(NUDT) in 2005 and 2010 supervised by Prof. Huowang Chen and Prof. Zhoujun Li. He was a Post-graduate Internships in National University of Singapore supervised by Prof. Chang Ee-Chien during 2008-2009. Currently, he is a professor and a vice director of the center of system software in NUDT. He focus on system software, including security and performance in AI (mostly on NLP) and OS (mostly on Linux and Android). He has published more than 60 papers, including SIGCOMM, COLING, ICPP, SecureComm, ISPA etc. Email: yj[at]nudt.edu.cn Jun Ma Jun Ma obtained his BS and PHD from National University of Defense Technology(NUDT) China in 2005 and 2011 supervised by Prof. Zhiying Wang. He is a associate research fellow in Software Engineering Research Center of Computer School, NUDT. His research focuses on operating system(including architecture, kernel, security, desktop, etc), information security(including access control, trust computing, data leakage protection, data recovery, etc.), software engineering(including software ecosystem, dependency management, etc.). He has published more than 30 papers and made a lot of practical engineering systems on Linux, Windows and embedded systems. Email: majun[at]nudt.edu.cn ShaSha Li Shasha Li obtained BS and PHD from National University of Defense Technology(NUDT) in 2005 and 2011 supervised by Prof. Huowang Chen and Prof. Zhoujun Li. She was a Post-graduate Internships in MSRA supervised by Prof. Chin-Yew Lin during 2008-2011. Currently, She is a associate professor of School of Computer Science in NUDT. She focus on natural language processing and knowledge graph. She has published more than 40 papers, including ACL, COLING, TKDE, IPM etc. Email: shashali[at]nudt.edu.cn XiaoDong Liu Xiaodong Liu received his BS and Ph.D in Computer Science and Technology from the National University of Defense Technology (NUDT), China in 2007 and 2013, respectively. Currently he works as an associate professor at NUDT and his research mainly focuses on desktop operating systems, software engineering and troubleshooting. Email: liuxiaodong[at]nudt.edu.cn Long Peng Long Peng received his BS and MS in Computer Science and Technology from the National University of Defense Technology (NUDT), China in 2009 and 2012. After obtained his doctor degree in Engineering Sciences from Vrije Universiteit Brussel in 2017, he works as an assistant research fellow at NUDT. His research topics include real-time and mobile operating systems, embedded systems, robotics software frameworks and intelligent control systems. Email: penglong[at]nudt.edu.cn Jing Wang Jing Wang received her BS and Ph.D in Computer Science and Technology from the National University of Defense Technology (NUDT), China in 2008 and 2019, respectively. Currently she works as an assistant research fellow at NUDT.Her research focuses on operating system，software engineering. Email:wangjing[at]nudt.edu.cn Li zhuo Zhuo Li received his PhD from the University of Chinese Academy of Sciences in 2023 supervised by Prof. Xu Zhou. He pursued a Joint PhD program in Ghent University supervised by Prof. Filip De Truck during 2021-2022. Currently, he works as a postdoctoral researcher at the National University of Defense Technology (NUDT) supervised by Prof. Jie Yu. His research focuses on intelligent operating systems, multi-agent systems, and reinforcement learning. Email: lizhuo[at]nudt.edu.cn","link":"/leaders/index.html"},{"title":"Honor","text":"竞赛评测 麒麟杯全国开软软件应用大赛，全国二等奖 科大讯飞2021文本匹配竞赛，全国第一名 CCKS2019信息抽取竞赛，全国第一名 CCKS2020信息抽取竞赛，全国第三名 CHIP2018信息抽取竞赛，全国第二名 承担项目 国防预研项目 《基于国产处理器的XX操作系统多领域定制增强技术》 国防预研项目 《XX操作系统内核及形式化验证》 国防预研项目 《基于动态监控的XX操作系统故障扫描与检测技术》 XX综合研究项目《XX操作系统兼容性评估技术》 国家核高基重大专项《XX移动终端操作系统》 国家863重点项目《面向XX的特定XXXX技术》 国家自然科学基金《结合社交网络的信息网络传播分析研究》 国家自然科学基金《基于面向话题的加权社会网络的个性化推荐及检索技术研究》 国防基础加强项目《新型软硬一体XX操作系统XX内核设计技术》 国防预研项目《新一代XX移动终端操作系统技术》 国防预研项目《国产平台的应用生态迁移技术》 国防预研项目《面向异构含错小样本数据的远监督训练数据标注》 国防预研项目《伪标签半监督特征提取技术研究及算法实现》 国防预研项目《基于网络碎碎片信息的目标态势挖掘新技术研究》 湖南省重点研发课题《面向国产CPU平台和自主操作系统的新型桌面环境设计与实现技术》 湖南省自然科学基金《面向文本的神经网络攻击与防御关键技术研究》 湖南省自然科学基金《面向信息抽取的小样本学习模型研究》 成果产出 XX操作系统定制增强技术 XX操作系统内核 基于依赖关系的操作系统兼容性分析技术 优麒麟开源操作系统 基于用户情感分析的话题热度预测技术 面向转发行为分析的情感建模方法 基于文章-作者网络的维基百科文章质量分析 基于话题传播群体分析的水军发现技术 大规模社会网络中影响最大化问题高效处理技术 面向命名实体识别和关系抽取的远监督数据标注技术 伪标签半监督特征提取算法","link":"/honor/index.html"}],"posts":[{"title":"About","text":"The system group is a comprehensive research group studying artificial intelligence systems, novel operating systems, and intelligent software systems. The group is established by Prof. Jie Yu, deputy director of the Engineering Research Center of National Fundamental Software, and is funded by National Natural Science Foundation of China, National Key Research and Development Program, Equipment Preliminary Research Project, National Nuclear High Foundation Key Project, and Hunan Provincial Natural Science Foundation. Our goal is to research cutting-edge artificial intelligence technologies, novel OS architecture, key technologies for performance optimization, security defense of intelligent systems and sustainable large language models. Research interestsLarge language model (LLM) Security of LLM Refreshing LLM Multi-modal LLM Neural Network Security Text adversarial attack and defense Image adversarial attack and defense Novel Operating System AI+OS RISC-V oriented OS architecture design Domestic platforms oriented compatible runtime environment construction Kernel Runtime","link":"/2023/12/07/Homepage/"}],"tags":[],"categories":[]}